In [1]:
import pandas as pd      
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.preprocessing import StandardScaler, MinMaxScaler, RobustScaler
from sklearn.metrics import mean_squared_error, mean_absolute_error, r2_score
from sklearn.model_selection import train_test_split

from scipy.stats import skew

from sklearn.model_selection import cross_validate, cross_val_score
import warnings
warnings.filterwarnings('ignore')
plt.rcParams["figure.figsize"] = (10,6)
pd.set_option('display.max_columns', 500) 
pd.set_option('display.max_rows', 500)

In [2]:
data = pd.read_csv('bank-additional.csv',sep=';')
data

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,30,blue-collar,married,basic.9y,no,yes,no,cellular,may,fri,487,2,999,0,nonexistent,-1.8,92.893,-46.2,1.313,5099.1,no
1,39,services,single,high.school,no,no,no,telephone,may,fri,346,4,999,0,nonexistent,1.1,93.994,-36.4,4.855,5191.0,no
2,25,services,married,high.school,no,yes,no,telephone,jun,wed,227,1,999,0,nonexistent,1.4,94.465,-41.8,4.962,5228.1,no
3,38,services,married,basic.9y,no,unknown,unknown,telephone,jun,fri,17,3,999,0,nonexistent,1.4,94.465,-41.8,4.959,5228.1,no
4,47,admin.,married,university.degree,no,yes,no,cellular,nov,mon,58,1,999,0,nonexistent,-0.1,93.200,-42.0,4.191,5195.8,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4114,30,admin.,married,basic.6y,no,yes,yes,cellular,jul,thu,53,1,999,0,nonexistent,1.4,93.918,-42.7,4.958,5228.1,no
4115,39,admin.,married,high.school,no,yes,no,telephone,jul,fri,219,1,999,0,nonexistent,1.4,93.918,-42.7,4.959,5228.1,no
4116,27,student,single,high.school,no,no,no,cellular,may,mon,64,2,999,1,failure,-1.8,92.893,-46.2,1.354,5099.1,no
4117,58,admin.,married,high.school,no,no,no,cellular,aug,fri,528,1,999,0,nonexistent,1.4,93.444,-36.1,4.966,5228.1,no
4118,34,management,single,high.school,no,yes,no,cellular,nov,wed,175,1,999,0,nonexistent,-0.1,93.200,-42.0,4.120,5195.8,no

In [3]:
df = data.copy()

In [4]:
df.head()

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,30,blue-collar,married,basic.9y,no,yes,no,cellular,may,fri,487,2,999,0,nonexistent,-1.8,92.893,-46.2,1.313,5099.1,no
1,39,services,single,high.school,no,no,no,telephone,may,fri,346,4,999,0,nonexistent,1.1,93.994,-36.4,4.855,5191.0,no
2,25,services,married,high.school,no,yes,no,telephone,jun,wed,227,1,999,0,nonexistent,1.4,94.465,-41.8,4.962,5228.1,no
3,38,services,married,basic.9y,no,unknown,unknown,telephone,jun,fri,17,3,999,0,nonexistent,1.4,94.465,-41.8,4.959,5228.1,no
4,47,admin.,married,university.degree,no,yes,no,cellular,nov,mon,58,1,999,0,nonexistent,-0.1,93.200,-42.0,4.191,5195.8,no

In [5]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
age,4119.0,40.113620,10.313362,18.000,32.000,38.000,47.000,88.000
duration,4119.0,256.788055,254.703736,0.000,103.000,181.000,317.000,3643.000
campaign,4119.0,2.537266,2.568159,1.000,1.000,2.000,3.000,35.000
pdays,4119.0,960.422190,191.922786,0.000,999.000,999.000,999.000,999.000
previous,4119.0,0.190337,0.541788,0.000,0.000,0.000,0.000,6.000
emp.var.rate,4119.0,0.084972,1.563114,-3.400,-1.800,1.100,1.400,1.400
cons.price.idx,4119.0,93.579704,0.579349,92.201,93.075,93.749,93.994,94.767
cons.conf.idx,4119.0,-40.499102,4.594578,-50.800,-42.700,-41.800,-36.400,-26.900
euribor3m,4119.0,3.621356,1.733591,0.635,1.334,4.857,4.961,5.045
nr.employed,4119.0,5166.481695,73.667904,4963.600,5099.100,5191.000,5228.100,5228.100

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4119 entries, 0 to 4118
Data columns (total 21 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             4119 non-null   int64
 1   job             4119 non-null   object
 2   marital         4119 non-null   object
 3   education       4119 non-null   object
 4   default         4119 non-null   object
 5   housing         4119 non-null   object
 6   loan            4119 non-null   object
 7   contact         4119 non-null   object
 8   month           4119 non-null   object
 9   day_of_week     4119 non-null   object
 10  duration        4119 non-null   int64
 11  campaign        4119 non-null   int64
 12  pdays           4119 non-null   int64
 13  previous        4119 non-null   int64
 14  poutcome        4119 non-null   object
 15  emp.var.rate    4119 non-null   float64
 16  cons.price.idx  4119 non-null   float64
 17  cons.conf.idx   4119 non-null   float64
 18  euribor3m       4119 non-null   float64
 19  nr.employed     4119 non-null   float64
 20  y               4119 non-null   object
dtypes: float64(5), int64(5), object(11)
memory usage: 675.9+ KB

In [7]:
object_col=df.columns[df.dtypes=="object"]
object_col

Index(['job', 'marital', 'education', 'default', 'housing', 'loan', 'contact',
       'month', 'day_of_week', 'poutcome', 'y'],
      dtype='object')

In [9]:
for feature in df.columns:
    if df[feature].dtype=="object":
        print(df[feature].unique())
#with taht we can see the several output,that we have in our columns than unique.
#admin had a dot at the end. I think it is better if I remove that

['blue-collar' 'services' 'admin.' 'entrepreneur' 'self-employed'
 'technician' 'management' 'student' 'retired' 'housemaid' 'unemployed'
 'unknown']
['married' 'single' 'divorced' 'unknown']
['basic.9y' 'high.school' 'university.degree' 'professional.course'
 'basic.6y' 'basic.4y' 'unknown' 'illiterate']
['no' 'unknown' 'yes']
['yes' 'no' 'unknown']
['no' 'unknown' 'yes']
['cellular' 'telephone']
['may' 'jun' 'nov' 'sep' 'jul' 'aug' 'mar' 'oct' 'apr' 'dec']
['fri' 'wed' 'mon' 'thu' 'tue']
['nonexistent' 'failure' 'success']
['no' 'yes']

In [13]:
df[df.job == 'admin.']  #there are in 1012 rows admin.

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
4,47,admin.,married,university.degree,no,yes,no,cellular,nov,mon,58,1,999,0,nonexistent,-0.1,93.200,-42.0,4.191,5195.8,no
6,32,admin.,single,university.degree,no,yes,no,cellular,sep,mon,290,4,999,0,nonexistent,-1.1,94.199,-37.5,0.879,4963.6,no
12,36,admin.,married,high.school,no,no,no,telephone,may,wed,97,2,999,0,nonexistent,1.1,93.994,-36.4,4.859,5191.0,no
14,29,admin.,single,high.school,no,no,no,cellular,may,fri,553,2,999,0,nonexistent,-1.8,92.893,-46.2,1.313,5099.1,no
16,44,admin.,divorced,university.degree,no,no,no,cellular,jul,wed,191,6,999,0,nonexistent,1.4,93.918,-42.7,4.957,5228.1,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4108,32,admin.,married,university.degree,no,yes,no,telephone,may,thu,151,5,999,0,nonexistent,-1.8,92.893,-46.2,1.266,5099.1,no
4113,31,admin.,single,university.degree,no,yes,no,cellular,nov,thu,463,1,999,0,nonexistent,-0.1,93.200,-42.0,4.076,5195.8,no
4114,30,admin.,married,basic.6y,no,yes,yes,cellular,jul,thu,53,1,999,0,nonexistent,1.4,93.918,-42.7,4.958,5228.1,no
4115,39,admin.,married,high.school,no,yes,no,telephone,jul,fri,219,1,999,0,nonexistent,1.4,93.918,-42.7,4.959,5228.1,no
4117,58,admin.,married,high.school,no,no,no,cellular,aug,fri,528,1,999,0,nonexistent,1.4,93.444,-36.1,4.966,5228.1,no

In [15]:
df.replace(['admin.'],'admin',inplace=True)

In [16]:
df[df.job == 'admin.']  #now there are no admin.

Empty DataFrame
Columns: [age, job, marital, education, default, housing, loan, contact, month, day_of_week, duration, campaign, pdays, previous, poutcome, emp.var.rate, cons.price.idx, cons.conf.idx, euribor3m, nr.employed, y]
Index: []

In [17]:
object_col=df.columns[df.dtypes=="object"]
object_col

for col in object_col:
    print(col)
    print("--"*8)
    print(df[col].value_counts(dropna=False))
    print("--"*20)

    #thre are unknown ,I wanna change that to NaN

job
----------------
admin            1012
blue-collar       884
technician        691
services          393
management        324
retired           166
self-employed     159
entrepreneur      148
unemployed        111
housemaid         110
student            82
unknown            39
Name: job, dtype: int64
----------------------------------------
marital
----------------
married     2509
single      1153
divorced     446
unknown       11
Name: marital, dtype: int64
----------------------------------------
education
----------------
university.degree      1264
high.school             921
basic.9y                574
professional.course     535
basic.4y                429
basic.6y                228
unknown                 167
illiterate                1
Name: education, dtype: int64
----------------------------------------
default
----------------
no         3315
unknown     803
yes           1
Name: default, dtype: int64
----------------------------------------
housing
----------------
yes        2175
no         1839
unknown     105
Name: housing, dtype: int64
----------------------------------------
loan
----------------
no         3349
yes         665
unknown     105
Name: loan, dtype: int64
----------------------------------------
contact
----------------
cellular     2652
telephone    1467
Name: contact, dtype: int64
----------------------------------------
month
----------------
may    1378
jul     711
aug     636
jun     530
nov     446
apr     215
oct      69
sep      64
mar      48
dec      22
Name: month, dtype: int64
----------------------------------------
day_of_week
----------------
thu    860
mon    855
tue    841
wed    795
fri    768
Name: day_of_week, dtype: int64
----------------------------------------
poutcome
----------------
nonexistent    3523
failure         454
success         142
Name: poutcome, dtype: int64
----------------------------------------
y
----------------
no     3668
yes     451
Name: y, dtype: int64
----------------------------------------

In [76]:
df.y.value_counts(dropna=False)

# Our data can be a imbalance data, 
# but yet it is early to say that,we must look at our confusion_report or score

no     3668
yes     451
Name: y, dtype: int64

In [18]:
df.replace(['unknown'],np.nan, inplace=True)  # I replaced the 'unknown' to np.none

In [19]:
df.isnull().sum()

age                 0
job                39
marital            11
education         167
default           803
housing           105
loan              105
contact             0
month               0
day_of_week         0
duration            0
campaign            0
pdays               0
previous            0
poutcome            0
emp.var.rate        0
cons.price.idx      0
cons.conf.idx       0
euribor3m           0
nr.employed         0
y                   0
dtype: int64

In [20]:
df.shape

(4119, 21)

In [21]:
df_after_drop = df.dropna()

In [22]:
df_after_drop.shape   #If I drop that I will lose about 1000 observation,that is terribel

(3090, 21)

# Handling with missing Value

Handling for 'default' features

In [24]:
df.default.value_counts(dropna=False) 
#that is relevant with credit ,whether he has a credit or not
#the ratio can be like y columns
#because of that I'll change the NaN value to yes. with that can be the ratio like y columns

no     3315
NaN     803
yes       1
Name: default, dtype: int64

In [29]:
df.default.replace([np.nan],'unknown',inplace=True)

In [30]:
df.default.value_counts(dropna=False)

no         3315
unknown     803
yes           1
Name: default, dtype: int64

In [79]:
df[df.default == 'yes']
#there is only one sample from this kind,I wanna drop this row
#because to fit a atrribute we need  at least 15-20 rows

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
3514,31,unemployed,married,high.school,yes,no,no,cellular,nov,tue,111,2,999,1,failure,-0.1,93.2,-42.0,4.153,5195.8,no

In [86]:
df =df.drop(3514)

In [88]:
df[df.default == 'yes']   #now there is no this row

Empty DataFrame
Columns: [age, job, marital, education, default, housing, loan, contact, month, day_of_week, duration, campaign, pdays, previous, poutcome, emp.var.rate, cons.price.idx, cons.conf.idx, euribor3m, nr.employed, y]
Index: []

In [89]:
#Madem Data Science eski gözlemlere bakip,yeni tahminler yapmaksa,bende eski gözlemlere bakarak bu unknown'un 
#yes'e mi yoksa no'ya mi ait oldugunu belirlemeye calisayim

In [90]:
df[df.y == 'no'].groupby('default',dropna=False).count()['y']

#that say us,if default = 'no' is, 2913 of the people didn't get a subscribe y=0
#there is only one of this group,his default = yes an didn't get subscribe

default
no         2913
unknown     754
Name: y, dtype: int64

In [91]:
df[df.y == 'yes'].groupby('default',dropna=False).count()['y']

#that say us,if default = 'no' is, 402 of the people did get a subscribe
#

default
no         402
unknown     49
Name: y, dtype: int64

In [92]:
df[df.default == 'unknown'].groupby('y',dropna=False).count()

#hier we see that,if you have a default, it is diffucullt to get a subsibrice
#y->no->754
#y->yes->49

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed
y,,,,,,,,,,,,,,,,,,,,
no,754,737,753,711,754,731,731,754,754,754,754,754,754,754,754,754,754,754,754,754
yes,49,48,49,44,49,48,48,49,49,49,49,49,49,49,49,49,49,49,49,49

In [93]:
df[df.y == 'yes'].groupby('default',dropna=False).count()

,age,job,marital,education,housing,loan,contact,month,day_of_week,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
default,,,,,,,,,,,,,,,,,,,,
no,402,399,401,381,394,394,402,402,402,402,402,402,402,402,402,402,402,402,402,402
unknown,49,48,49,44,48,48,49,49,49,49,49,49,49,49,49,49,49,49,49,49